{
"Apple___Apple_scab":"Choose resistant varieties when possible. Rake under trees and destroy infected leaves to reduce the number of fungal spores available to start the disease cycle over again next spring. Water in the evening or early morning hours (avoid overhead irrigation) to give the leaves time to dry out before infection can occur.",
"Apple___Black_rot":"Hopefully, you are now well aware of the importance of getting rid of these sources of fungal infection.  This is the primary method of control. Remove the cankers by pruning at least 15 inches below the end and burn or bury them.  Also take preventative care with new season prunings and burn them, too.",
"Apple___Cedar_apple_rust":"Choose resistant cultivars when available. Rake up and dispose of fallen leaves and other debris from under trees. Remove galls from infected junipers. In some cases, juniper plants should be removed entirely.",
"Apple___healthy": "Healthy leaf don't require any treatment",
"Cherry_(including_sour)___Powdery_mildew":"The key to managing powdery mildew on the fruit is to keep the disease off of the leaves.  Most synthetic fungicides are preventative, not eradicative, so be pro-active about disease prevention.  Maintain a consistent program from shuck fall through harvest. ",
"Blueberry___healthy": "Healthy leaf don't require any treatment",
"Cherry_(including_sour)___healthy": "Healthy leaf don't require any treatment",
"Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Plant corn hybrids with resistance to the disease; crop rotation and plowing debris into soil may reduce levels of inoculum in the soil but may not provide control in areas where the disease is prevalent; foliar fungicides may be economically viable for some high yeilding susceptible hybrids.",
"Corn_(maize)___Common_rust_": "The most effective method of controlling the disease is to plant resistant hybrids; application of appropriate fungicides may provide some degree on control and reduce disease severity; fungicides are most effective when the amount of secondary inoculum is still low, generally when plants only have a few rust pustules per leaf.",
"Corn_(maize)___Northern_Leaf_Blight": "Follow proper tillage to reduce fungus inoculum from crop debris. Follow crop rotation with non host crop. Grow available resistant varieties. In severe case of disease incidence apply suitable fungicide.",
"Corn_(maize)___healthy": "Healthy leaf don't require any treatment",
"Grape___Black_rot": "Black rot (Guignardia bidwelli) is a fungal disease that occurs in grapes grown in a hot and humid climate. This fungal disease has the ability to ruin an entire crop of grapes if it is allowed to spread unchecked. Fortunately, there are both cultural and chemical ways to rid your plants of this disease.",
"Grape___Esca_(Black_Measles)": "The fungi Phaeoacremonium aleophilum, Phaeomoniella chlamydospora[1] and Fomitiporia mediterranea[2] are associated with the disease.",
"Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "The pathogen survives in infected plant residue in soil and seed borne.Favourable conditionsThe disease is more prevalent during June-August and again in February-March.Temperature range of 25-30 ºC and relative humidity of 80-90% is favourable for the development of the disease.",
"Grape___healthy": "Healthy leaf don't require any treatment",
"Orange___Haunglongbing_(Citrus_greening)": "A number of predators and parasites feed on ACP. The nymphs are killed by tiny parasitic wasps and various predators, including lady beetle adults and larvae, syrphid fly larvae, lacewing larvae, and minute pirate bugs. Some spiders, birds, and other general predators feed on adult psyllids.",
"Peach___Bacterial_spot": "It's Easy To Misdiagnose Bacterial Spot On Peaches. Bacterial spot is a major disease for peach and nectarine growing areas experiencing warm, wet springs and summers. Effective management requires a diverse toolbox to combat the disease from shuck split through cover sprays. One such tool is the use of copper",
"Peach___healthy": "Healthy leaf don't require any treatment",
"Pepper,_bell___Bacterial_spot": "For plant beds and flats in the greenhouse, keep the house as dry as possible and avoid splashing water. Spray with fixed coppers (i.e., tribasic copper sulfate and copper hydroxide), alone or in combination with 200 ppm streptomycin (11b/100 gal water in the copper spray), with the addition of spreader-sticker to improve the effectiveness of the spray. Streptomycin cannot be used in the field. Start field treatment as soon as disease appears,",
"Pepper,_bell___healthy": "Healthy leaf don't require any treatment",
"Potato___Early_blight": "Alternaria solani is a fungal pathogen that produces a disease in tomato and potato plants called early blight. The pathogen produces distinctive bullseye patterned leaf spots and can also cause stem lesions and fruit rot on tomato and tuber blight on potato",
"Potato___Late_blight": "If infected tubers make it into the storage bin, there's a very high risk to the storage life of that bin. Once in storage, there isn't much that can be done besides emptying the parts of the bin that contain tubers infected with Phytophthora infestans. ",
"Potato___healthy": "Healthy leaf don't require any treatment",
"Raspberry___healthy": "Healthy leaf don't require any treatment",
"Soybean___healthy": "Healthy leaf don't require any treatment",
"Squash___Powdery_mildew": "Use resistant varieties when they are available. Thin plants to proper spacing so each leaf gets good exposure to sun and fresh air. Plant fast-growing varieties of summer squash to sidestep this disease. Starting in early summer, spray plants every 10 days with a mixture of one part milk (any kind) to four parts water.",
"Strawberry___Leaf_scorch": "The best way to treat this disease is to alter watering practices and allow for dryer conditions. If that isn't possible, you can treat your strawberries with organic fungicides like Captan 50 WP and Copper compounds.",
"Strawberry___healthy": "Healthy leaf don't require any treatment",
"Tomato___Bacterial_spot": "Bacterial spot can be a devastating disease when the weather is warm and humid. The disease can affect all above-ground parts of tomato and pepper plants: stems, petioles, leaves, and fruits. ... Tomato leaves have small (<1/8 inch), brown, circular spots surrounded by a yellow halo.",
"Tomato___Early_blight": "Prune or stake plants to improve air circulation and reduce fungal problems.Make sure to disinfect your pruning shears (one part bleach to 4 parts water) after each cut.Keep the soil under plants clean and free of garden debris. ...Drip irrigation and soaker hoses can be used to help keep the foliage dry.",
"Tomato___Late_blight": "When it rains, water hits the ground, splashing soil and spores onto the lower leaves of plants, where the disease shows its earliest symptoms. While there is no cure for blight on plants or in the soil, 2 there are some simple ways to control this disease.",
"Tomato___Leaf_Mold": "Managing Tomatoes With Leaf Mold. If you grow tomatoes in a greenhouse or high tunnel, you are more likely to have problems with leaf mold of tomato. ... Read on to find out the symptoms of tomatoes with leaf mold and tomato leaf mold treatment options.",
"Tomato___Septoria_leaf_spot": "Removing infected leaves. Remove infected leaves immediately, and be sure to wash your hands thoroughly before working with uninfected plants.Consider organic fungicide options. ...Consider chemical fungicides.",
"Tomato___Spider_mites Two-spotted_spider_mite": "Spray infested plants with horticultural oil or insecticidal soap to kill spider mites. Follow product recommendations for proper mixing and preparation. Make certain to cover the undersides of leaves thoroughly.",
"Tomato___Target_Spot": "Do not plant new crops next to older ones that have the disease.Plant as far as possible from papaya, especially if leaves have small angular spots (Photo 5).Check all seedlings in the nursery, and throw away any with leaf spots.",
"Tomato___Tomato_Yellow_Leaf_Curl_Virus": "Maintain good weed control in the field and surrounding areas. Prevent the spread of any whiteflies to healthy plants. Tomato and pepper fields should be cleaned up immediately after harvest. Also destroy crop residues of melons and cotton immediately after harvest to reduce whitefly migration.",
"Tomato___Tomato_mosaic_virus": "Inspect transplants prior to purchase. Choose only transplants showing no clear symptoms. Avoid planting in fields where tomato root debris is present, as the virus can survive long-term in roots. Wash hands with soap and water before and during the handling of plants to reduce potential spread between plants",
"Tomato___healthy": "Healthy leaf don't require any treatment"
}





